<a href="https://colab.research.google.com/github/lindseyvanosky/Titanic-Data-Analysis-Exercise/blob/main/LV_Titanic_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Titanic Data Analysis
- Lindsey Vanosky
- 05.26.22

In [ ]:
import pandas as pd
import numpy as np

filename = "/content/drive/MyDrive/Coding Dojo/02 Week 2: Pandas/Data Sets/titanic.csv"
df = pd.read_csv(filename)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#What percentage of people survived?

In [ ]:
#Determining if there are any missing values in the survivor column 
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#I had run df = df.drop(columns = ["Cabin, Embarked"]) and accidentally lost the cell. But since it was overwritten I get an error when I try to show the work:
df = df.drop(columns = ["Cabin", "Embarked"])
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500

In [ ]:
#Filling in "Age"
df["Age"].isna().sum()

177

In [ ]:
df["Age"].fillna("missing", inplace = True)
df["Age"]

0         22.0
1         38.0
2         26.0
3         35.0
4         35.0
        ...
886       27.0
887       19.0
888    missing
889       26.0
890       32.0
Name: Age, Length: 891, dtype: object

In [ ]:
survived_filter = df["Survived"].mean()
survived_filter
#38.38% of passengers survived.

0.3838383838383838

# Double checking my work

In [ ]:
survival_filter = df["Survived"] == 1 #also creating a survival filter for later use 
survival_df = df.loc[survival_filter, :]
survival_df['Survived'].value_counts().sum()
#I have determined that 342 passangers survived

342

In [ ]:
#I have identified that there are 891 enteries
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    object
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
dtypes: float64(1), int64(5), object(4)
memory usage: 69.7+ KB

In [ ]:
342 / 891 * 100
#38.38% of passengers survived the Titanic

38.38383838383838

#How many of each sex survived?

In [ ]:
df["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [ ]:
df["Sex"].isna().sum()

0

In [ ]:
df["Sex"].nunique()

2

In [ ]:
#Creating a female filter
female_filter = df["Sex"] == "female"
female_df = df.loc[female_filter, :]
female_df["Sex"].value_counts() #double checking my work

female    314
Name: Sex, dtype: int64

In [ ]:
#creating a male filter
male_filter = df["Sex"] == "male"
male_df = df.loc[male_filter, :]
male_df["Sex"].value_counts() #double checking my work

male    577
Name: Sex, dtype: int64

In [ ]:
#Male survivors
male_survival_df = df.loc[survival_filter & male_filter, :]
male_survival_df.value_counts().sum()

109

In [ ]:
#Female survivors 
female_survival_df = df.loc[survival_filter & female_filter, :]
female_survival_df.value_counts().sum()

233

#Survival rate of $10 tickets or less

In [ ]:
#creating a $10 or less filter
fare_filter = df["Fare"] <= 10
fare_df = df.loc[fare_filter, :]
fare_df.value_counts().sum()

336

In [ ]:
#running the fare filter against the survival filter 
fare_survive_df = df.loc[survival_filter & fare_filter, :]
fare_survive_df.value_counts().sum()

67

In [ ]:
67 / 336 * 100

19.940476190476193

Nearly 20% of $10 < ticket passengers survived

#Average age of non-survivors

In [ ]:
#Changing "missing" str to 0 int
df['Age'] = df['Age'].replace('missing', int(0))
df["Age"].head(30)

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      0.0
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
15    55.0
16     2.0
17     0.0
18    31.0
19     0.0
20    35.0
21    34.0
22    15.0
23    28.0
24     8.0
25    38.0
26     0.0
27    19.0
28     0.0
29     0.0
Name: Age, dtype: float64

In [ ]:
#Replacing former "missing" values in "Age" column with avg age
df['Age'] = df['Age'].replace(0, df["Age"].mean())
df["Age"].head(30)

0     22.000000
1     38.000000
2     26.000000
3     35.000000
4     35.000000
5     23.799293
6     54.000000
7      2.000000
8     27.000000
9     14.000000
10     4.000000
11    58.000000
12    20.000000
13    39.000000
14    14.000000
15    55.000000
16     2.000000
17    23.799293
18    31.000000
19    23.799293
20    35.000000
21    34.000000
22    15.000000
23    28.000000
24     8.000000
25    38.000000
26    23.799293
27    19.000000
28    23.799293
29    23.799293
Name: Age, dtype: float64

In [ ]:
#Creating a df of dead passengers 
dead_df = df.loc[~survival_filter]
dead_df.value_counts().sum()

549

In [ ]:
#Determing average age of non surviors - 29!
dead_df["Age"].mean()

29.071788007580288

#Average age of survivors

In [ ]:
#Determining the average age of survivors - 27! 
survivor_df = df.loc[survival_filter, :]
survivor_df["Age"].mean()

27.65272874948314

#Groupby Sex

In [ ]:
#Survivor avg age by sex
survivor_df.groupby('Sex')['Age'].mean()

Sex
female    28.067702
male      26.765676
Name: Age, dtype: float64

In [ ]:
#Non-survivor avg age by sex
dead_df.groupby("Sex")["Age"].mean()

Sex
female    24.785037
male      29.813726
Name: Age, dtype: float64